---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException
source: html/0d986357-eedd-fdf5-6fa3-1e09398f94a5.htm
---
# CheckoutElementsRequestTooLargeException Methods

Retrieves data needed to serialize the target object.